#include <iostream>
#include <cstring>
using namespace std;

int main()
{
    int row, column;
    char char_row = '~', char_column = '!';

    // 입력 시작
    cout << "Enter Row and Column: ";
    cin >> row >> column;
    cout << "Display Row : ";
    cin >> char_row;
    cout << "Display Column : ";
    cin >> char_column;
    // 입력 끝

    // 행 생성
    char **map = new char *[row]; // Dynamic Allocation
    // 컬럼 생성
    for (int i = 0; i < row; i++)
        map[i] = new char[column];
    
    // 처음 맵의 값을 정해준다.
    
    map[0][0] = '-';
    map[0][1] = '-';
    map[0][2] = '-';
    map[0][3] = '-';
    map[0][4] = '-';
    map[0][5] = '-';
    map[0][6] = '-';
    map[0][7] = '-';
    map[0][8] = '-';
    map[0][9] = '-';
    map[0][10] = '-';
    map[0][11] = '-';
    map[0][12] = '-';
    map[0][13] = '-';
    map[0][14] = '-';
    map[0][15] = '-';
    map[0][16] = '-';
    map[0][17] = '-';
    map[0][18] = '-';
    map[0][19] = '-';
    map[0][20] = '-';
    map[0][21] = '-';
    map[0][22] = '-';
    map[0][23] = '-';
    map[0][24] = '-';
    map[0][25] = '-';
    map[0][26] = '-';
    map[1][0] = '|';
    map[2][0] = '|';
    map[3][0] = '|';
    map[4][0] = '|';
    map[5][0] = '|';
    map[6][0] = '|';
    map[7][0] = '|';
    map[8][0] = '|';
    map[9][0] = '|';
    map[10][0] = '|';
    map[11][0] = '|';
    map[12][0] = '|';
    map[13][0] = '|';
    map[14][0] = '|';
    map[15][0] = '|';
    map[16][0] = '|';
    map[17][0] = '|';
    map[18][0] = '|';
    map[19][0] = '|';
    map[17][1] = '-';
    map[17][2] = '-';
    map[17][3] = '-';
    map[17][4] = '-';
    map[17][5] = '-';
    map[17][6] = '-';
    map[17][7] = '-';
    map[17][8] = '-';
    map[17][9] = '-';
    map[17][10] = '-';
    map[17][11] = '-';
    map[17][12] = '-';
    map[17][13] = '-';
    map[17][14] = '-';
    map[17][15] = '-';
    map[17][16] = '-';
    map[17][17] = '-';
    map[17][18] = '-';
    map[17][19] = '-';
    map[17][20] = '-';
    map[17][21] = '-';
    map[17][22] = '-';
    map[17][23] = '-';
    map[17][24] = '-';
    map[17][25] = '-';
    map[0][26] = '|';
    map[1][26] = '|';
    map[2][26] = '|';
    map[3][26] = '|';
    map[4][26] = '|';
    map[5][26] = '|';
    map[6][26] = '|';
    map[7][26] = '|';
    map[8][26] = '|';
    map[9][26] = '|';
    map[10][26] = '|';
    map[11][26] = '|';
    map[12][26] = '|';
    map[13][26] = '|';
    map[14][26] = '|';
    map[15][26] = '|';
    map[16][26] = '|';
    map[17][26] = '|';
    map[18][26] = '|';
    map[19][26] = '|';
    map[19][1] = '-';
    map[19][2] = '-';
    map[19][3] = '-';
    map[19][4] = '-';
    map[19][5] = '-';
    map[19][6] = '-';
    map[19][7] = '-';
    map[19][8] = '-';
    map[19][9] = '-';
    map[19][10] = '-';
    map[19][11] = '-';
    map[19][12] = '-';
    map[19][13] = '-';
    map[19][14] = '-';
    map[19][15] = '-';
    map[19][16] = '-';
    map[19][17] = '-';
    map[19][18] = '-';
    map[19][19] = '-';
    map[19][20] = '-';
    map[19][21] = '-';
    map[19][22] = '-';
    map[19][23] = '-';
    map[19][24] = '-';
    map[19][25] = '-';
    map[19][26] = '-';
    
    


    /*
    map[1][1] = ' ';
    map[1][3] = ' ';
    map[2][1] = ' ';
    map[2][3] = ' ';
    map[3][1] = ' ';
    map[3][3] = ' ';
    map[4][1] = ' ';
    map[4][3] = ' ';
    map[5][1] = ' ';
    map[5][3] = ' ';

    map[1][2] = '!';
    map[2][2] = '!';
    map[3][2] = '!';
    map[4][2] = '!';
    map[5][2] = '!';
    */

    // display
    for (int i = 0; i < row; i++){ // output each array element's value
        for (int j = 0; j < column; j++)
        {
            cout << map[i][j];
        }
        cout << endl;
    }
    delete[] map;
    return 0;
}